GT2/RANS/qZeta_lowRE/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 1e-09;
internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }


//Define epsilon and k zero at the walls
//The solver will automatically do the conversion from k and epsilon to q and Zeta
    bottom
    {
        type            fixedValue;
        //value           $internalField;
        value           uniform 1e-12;

	    //To use wall functions
        //type	        kqRWallFunction;	//BC1
	    //value           $internalField;
     	//type	        kLowReWallFunction;	//BC2
        //value           uniform 1e-09;
    }


    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
